app/controllers/secret_codes_controller.rb

SELECT  "codes".* FROM "codes" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3)
SELECT COUNT(*) FROM "codes"
---
  def index
    @secret_codes = Code.includes(:user).paginate(page: params[:page])

SELECT  "codes".* FROM "codes" WHERE "codes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "codes" WHERE "codes"."id" = ?  [["id", 5]]
---
  def destroy
    @code = Code.find(params[:id])
    if @code.destroy