app/controllers/users/registrations_controller.rb

  def create
    build_resource(sign_up_params)
    resource.save
    yield resource if block_given?
    if resource.persisted?
      resource.secret_code = Code.find(params[:user][:secret_code_attributes][:code])
---
SELECT  "codes".* FROM "codes" WHERE "codes"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]